Revit 2027 API
MasonryCMU.MasonryCMUColorByObject Property
 The property labeled "Color By Object" from the "MasonryCMU" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string MasonryCMUColorByObject { get; }
Public Shared ReadOnly Property MasonryCMUColorByObject As String
	Get
public:
static property String^ MasonryCMUColorByObject {
	String^ get ();
}
static member MasonryCMUColorByObject : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyBoolean".
See Also
Reference
MasonryCMU Class
Autodesk.Revit.DB.Visual Namespace